; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-11)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 )
(:init
(on b1 b3)
(on b2 b9)
(ontable b3)
(on b4 b1)
(on b5 b4)
(on b6 b10)
(ontable b7)
(on b8 b5)
(on b9 b6)
(on b10 b8)
(ontable b11)
(clear b2)
(clear b7)
(clear b11)
)
(:goal
(and
(on b1 b5)
(on b3 b7)
(on b4 b8)
(on b5 b11)
(on b6 b2)
(on b7 b1)
(on b8 b3)
(on b10 b4)
(on b11 b6))
)
)

; plan
1. (move-b-to-t b2 b9)
   deleted: (on b2 b9)
   added: (ontable b2) (clear b9)
   goals met: 0 of 9
2. (move-b-to-t b9 b6)
   deleted: (on b9 b6)
   added: (ontable b9) (clear b6)
   goals met: 0 of 9
3. (move-b-to-b b6 b10 b2)
   deleted: (clear b2) (on b6 b10)
   added: (on b6 b2) (clear b10)
   goals met: 1 of 9
4. (move-t-to-b b11 b6)
   deleted: (clear b6) (ontable b11)
   added: (on b11 b6)
   goals met: 2 of 9
5. (move-b-to-b b10 b8 b9)
   deleted: (clear b9) (on b10 b8)
   added: (on b10 b9) (clear b8)
   goals met: 2 of 9
6. (move-b-to-b b8 b5 b10)
   deleted: (clear b10) (on b8 b5)
   added: (on b8 b10) (clear b5)
   goals met: 2 of 9
7. (move-b-to-b b5 b4 b11)
   deleted: (clear b11) (on b5 b4)
   added: (on b5 b11) (clear b4)
   goals met: 3 of 9
8. (move-b-to-t b4 b1)
   deleted: (on b4 b1)
   added: (ontable b4) (clear b1)
   goals met: 3 of 9
9. (move-b-to-b b1 b3 b5)
   deleted: (clear b5) (on b1 b3)
   added: (on b1 b5) (clear b3)
   goals met: 4 of 9
10. (move-t-to-b b7 b1)
   deleted: (clear b1) (ontable b7)
   added: (on b7 b1)
   goals met: 5 of 9
11. (move-t-to-b b3 b7)
   deleted: (clear b7) (ontable b3)
   added: (on b3 b7)
   goals met: 6 of 9
12. (move-b-to-b b8 b10 b3)
   deleted: (clear b3) (on b8 b10)
   added: (on b8 b3) (clear b10)
   goals met: 7 of 9
13. (move-t-to-b b4 b8)
   deleted: (clear b8) (ontable b4)
   added: (on b4 b8)
   goals met: 8 of 9
14. (move-b-to-b b10 b9 b4)
   deleted: (clear b4) (on b10 b9)
   added: (on b10 b4) (clear b9)
   goals met: 9 of 9
